weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_2_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_2_7_OFF (23u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_0 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_0_OFF (24u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_1 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_1_OFF (25u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_2 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_2_OFF (26u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_3 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_3_OFF (27u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_4 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_4_OFF (28u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_5 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_5_OFF (29u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_6 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_6_OFF (30u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_R0_Bits.MCA_3_7 */
#define IFX_GTM_MON_ACTIVITY_R0_MCA_3_7_OFF (31u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_0 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_0_OFF (0u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_1 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_1_OFF (1u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_2 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_2_OFF (2u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_3 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_3_OFF (3u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_4 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_4_OFF (4u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_5 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_5_OFF (5u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_6 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_6_OFF (6u)

/** \brief Length for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_LEN (1u)

/** \brief Mask for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_MON_ACTIVITY_MCS_Bits.MCA_7 */
#define IFX_GTM_MON_ACTIVITY_MCS_MCA_7_OFF (7u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_EN_Bits.ABWC0_EN */
#define IFX_GTM_CMP_EN_ABWC0_EN_OFF (0u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_EN_Bits.ABWC1_EN */
#define IFX_GTM_CMP_EN_ABWC1_EN_OFF (1u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_EN_Bits.ABWC2_EN */
#define IFX_GTM_CMP_EN_ABWC2_EN_OFF (2u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CMP_EN_Bits.ABWC3_EN */
#define IFX_GTM_CMP_EN_ABWC3_EN_OFF (3u)

/** \brief Length for Ifx_GTM_CMP_EN_Bits.ABWC4_EN */
#define IFX_GTM_CMP_EN_ABWC4_EN_LEN (1u)

