weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_LOW_Bits.DYN_READ_ID8 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_LOW_DYN_READ_ID8_OFF (16u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID9 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID9_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID10 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID10_OFF (8u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_LEN (8u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_MSK (0xffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_READ_ID11 */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_READ_ID11_OFF (16u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_LEN (4u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_MSK (0xfu)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_CLK_WAIT */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_CLK_WAIT_OFF (24u)

/** \brief Length for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ARU_DYN_ROUTE_SR_HIGH_Bits.DYN_UPDATE_EN */
#define IFX_GTM_ARU_DYN_ROUTE_SR_HIGH_DYN_UPDATE_EN_OFF (28u)

/** \brief Length for Ifx_GTM_ARU_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_DYN_RDADDR_DYN_ARU_RDADDR_LEN (9u)

/** \brief Mask for Ifx_GTM_ARU_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_DYN_RDADDR_DYN_ARU_RDADDR_MSK (0x1ffu)

/** \brief Offset for Ifx_GTM_ARU_DYN_RDADDR_Bits.DYN_ARU_RDADDR */
#define IFX_GTM_ARU_DYN_RDADDR_DYN_ARU_RDADDR_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_LEN (7u)

/** \brief Mask for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_ARU_CADDR_Bits.CADDR_0 */
#define IFX_GTM_ARU_CADDR_CADDR_0_OFF (0u)

/** \brief Length for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_LEN (7u)

/** \brief Mask for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_MSK (0x7fu)

/** \brief Offset for Ifx_GTM_ARU_CADDR_Bits.CADDR_1 */
#define IFX_GTM_ARU_CADDR_CADDR_1_OFF (16u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK0_OFF (0u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK1_OFF (2u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK2 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK2_OFF (4u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK3 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK3_OFF (6u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK4 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK4_OFF (8u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK5 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK5_OFF (10u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK6 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK6_OFF (12u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_CLK7 */
#define IFX_GTM_CMU_CLK_EN_EN_CLK7_OFF (14u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK0 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK0_OFF (16u)

/** \brief Length for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_LEN (2u)

/** \brief Mask for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CMU_CLK_EN_Bits.EN_ECLK1 */
#define IFX_GTM_CMU_CLK_EN_EN_ECLK1_OFF (18u)

