weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN0_OFF (1u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN1_OFF (2u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN2_OFF (3u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN3_OFF (4u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN4 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN4_OFF (5u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN5 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN5_OFF (6u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN6_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN6 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN6_OFF (7u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN7_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN7 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN7_OFF (8u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN8_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN8_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN8 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN8_OFF (9u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN9_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN9 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN9_OFF (10u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN10_OFF (11u)

/** \brief Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_IRQ_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_IRQ_EN11_OFF (12u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DEST_ERR */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DEST_ERR_OFF (0u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID0 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID0_OFF (1u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID1 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID1_OFF (2u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID2 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID2_OFF (3u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID3 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID3_OFF (4u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID4 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID4_OFF (5u)

/** \brief Length for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_IRQ_FORCINT_Bits.TRG_DID5 */
#define IFX_GTM_BRC_IRQ_FORCINT_TRG_DID5_OFF (6u)

