weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN9_OFF (10u)

/** \brief Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN10_OFF (11u)

/** \brief Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_LEN (1u)

/** \brief Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_MSK (0x1u)

/** \brief Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EIRQ_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EIRQ_EN11_OFF (12u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA0_IRQ_OFF (0u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_NEW_DATA1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_NEW_DATA1_IRQ_OFF (1u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_ACC_ACK_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_ACC_ACK_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.ARU_ACC_ACK_IRQ */
#define IFX_GTM_ICM_IRQG_R0_ARU_ACC_ACK_IRQ_OFF (2u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_R0_BRC_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_R0_BRC_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.BRC_IRQ */
#define IFX_GTM_ICM_IRQG_R0_BRC_IRQ_OFF (3u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_R0_AEI_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_R0_AEI_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.AEI_IRQ */
#define IFX_GTM_ICM_IRQG_R0_AEI_IRQ_OFF (4u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_R0_CMP_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_R0_CMP_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.CMP_IRQ */
#define IFX_GTM_ICM_IRQG_R0_CMP_IRQ_OFF (5u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE0_IRQ_OFF (6u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE1_IRQ_OFF (7u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE2_IRQ_OFF (8u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE3_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE3_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE3_IRQ_OFF (9u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE4_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE4_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE4_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE4_IRQ_OFF (10u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE5_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE5_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.SPE5_IRQ */
#define IFX_GTM_ICM_IRQG_R0_SPE5_IRQ_OFF (11u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH0_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH0_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH0_IRQ_OFF (16u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH1_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH1_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH1_IRQ_OFF (17u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH2_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH2_IRQ_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH2_IRQ_OFF (18u)

/** \brief Length for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH3_IRQ_LEN (1u)

/** \brief Mask for Ifx_GTM_ICM_IRQG_R0_Bits.PSM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_R0_PSM0_CH3_IRQ_MSK (0x1u)

