weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_CTRL_Bits.ENDIS_CTRL7 */
#define IFX_GTM_TOM_TGC_ENDIS_CTRL_ENDIS_CTRL7_OFF (14u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT0 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT1 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT2 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT2_OFF (4u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT3 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT3_OFF (6u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT4 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT4_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT5 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT5_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT6 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT6_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_ENDIS_STAT_Bits.ENDIS_STAT7 */
#define IFX_GTM_TOM_TGC_ENDIS_STAT_ENDIS_STAT7_OFF (14u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL0_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL0_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL0 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL0_OFF (0u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL1_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL1_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL1 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL1_OFF (2u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL2_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL2_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL2 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL2_OFF (4u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL3_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL3_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL3 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL3_OFF (6u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL4_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL4_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL4 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL4_OFF (8u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL5_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL5_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL5 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL5_OFF (10u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL6_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL6_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL6 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL6_OFF (12u)

/** \brief Length for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL7_LEN (2u)

/** \brief Mask for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL7_MSK (0x3u)

/** \brief Offset for Ifx_GTM_TOM_TGC_OUTEN_CTRL_Bits.OUTEN_CTRL7 */
#define IFX_GTM_TOM_TGC_OUTEN_CTRL_OUTEN_CTRL7_OFF (14u)

