weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR4_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR4_CONF_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR5_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR5_CONF_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR6_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR6_CONF_OFF (4u)

/** \brief Length for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_LEN (2u)

/** \brief Mask for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_MSK (0x3u)

/** \brief Offset for Ifx_GTM_PSM_F2A_F2A_CTRL_Bits.STR7_CONF */
#define IFX_GTM_PSM_F2A_F2A_CTRL_STR7_CONF_OFF (6u)

/** \brief Length for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_LEN (29u)

/** \brief Mask for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_MSK (0x1fffffffu)

/** \brief Offset for Ifx_GTM_PSM_AFD_CH_BUF_ACC_Bits.DATA */
#define IFX_GTM_PSM_AFD_CH_BUF_ACC_DATA_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RBM */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RBM_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.RAP */
#define IFX_GTM_PSM_FIFO_CH_CTRL_RAP_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.FLUSH */
#define IFX_GTM_PSM_FIFO_CH_CTRL_FLUSH_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_CTRL_Bits.WULOCK */
#define IFX_GTM_PSM_FIFO_CH_CTRL_WULOCK_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_END_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_END_ADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_START_ADDR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_START_ADDR_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_UPPER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_UPPER_WM_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_LOWER_WM_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_LOWER_WM_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.EMPTY */
#define IFX_GTM_PSM_FIFO_CH_STATUS_EMPTY_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.FULL */
#define IFX_GTM_PSM_FIFO_CH_STATUS_FULL_OFF (1u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.LOW_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_LOW_WM_OFF (2u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_LEN (1u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_STATUS_Bits.UP_WM */
#define IFX_GTM_PSM_FIFO_CH_STATUS_UP_WM_OFF (3u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_LEN (11u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_MSK (0x7ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_FILL_LEVEL_Bits.LEVEL */
#define IFX_GTM_PSM_FIFO_CH_FILL_LEVEL_LEVEL_OFF (0u)

/** \brief Length for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_LEN (10u)

/** \brief Mask for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_PSM_FIFO_CH_WR_PTR_Bits.ADDR */
#define IFX_GTM_PSM_FIFO_CH_WR_PTR_ADDR_OFF (0u)

