weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE2I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE2I_EIRQ_EN_OFF (20u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE3I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE3I_EIRQ_EN_OFF (21u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TE4I_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TE4I_EIRQ_EN_OFF (22u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDTI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDTI_EIRQ_EN_OFF (23u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.CDSI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_CDSI_EIRQ_EN_OFF (24u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.TORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_TORI_EIRQ_EN_OFF (25u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.SORI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_SORI_EIRQ_EN_OFF (26u)

/** \brief Length for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_EIRQ_EN_Bits.DCGI_EIRQ_EN */
#define IFX_GTM_DPLL_EIRQ_EN_DCGI_EIRQ_EN_OFF (27u)

/** \brief Length for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INC_CNT1_Bits.INC_CNT1 */
#define IFX_GTM_DPLL_INC_CNT1_INC_CNT1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_INC_CNT2_Bits.INC_CNT2 */
#define IFX_GTM_DPLL_INC_CNT2_INC_CNT2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_EXT */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_EXT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_STATUS */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_STATUS_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_LEN (10u)

/** \brief Mask for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_MSK (0x3ffu)

/** \brief Offset for Ifx_GTM_DPLL_APT_SYNC_Bits.APT_2B_OLD */
#define IFX_GTM_DPLL_APT_SYNC_APT_2B_OLD_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_EXT */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_EXT_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_STATUS */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_STATUS_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_LEN (6u)

/** \brief Mask for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_MSK (0x3fu)

/** \brief Offset for Ifx_GTM_DPLL_APS_SYNC_Bits.APS_1C2_OLD */
#define IFX_GTM_DPLL_APS_SYNC_APS_1C2_OLD_OFF (14u)

/** \brief Length for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TBU_TS0_T_Bits.TBU_TS0_T */
#define IFX_GTM_DPLL_TBU_TS0_T_TBU_TS0_T_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_LEN (24u)

