weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Mask for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_TBU_TS0_S_Bits.TBU_TS0_S */
#define IFX_GTM_DPLL_TBU_TS0_S_TBU_TS0_S_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_ADD_IN_LD1_Bits.ADD_IN_LD1 */
#define IFX_GTM_DPLL_ADD_IN_LD1_ADD_IN_LD1_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_LEN (24u)

/** \brief Mask for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_MSK (0xffffffu)

/** \brief Offset for Ifx_GTM_DPLL_ADD_IN_LD2_Bits.ADD_IN_LD2 */
#define IFX_GTM_DPLL_ADD_IN_LD2_ADD_IN_LD2_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.FPCE */
#define IFX_GTM_DPLL_STATUS_FPCE_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.FPCE */
#define IFX_GTM_DPLL_STATUS_FPCE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.FPCE */
#define IFX_GTM_DPLL_STATUS_FPCE_OFF (0u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CSO */
#define IFX_GTM_DPLL_STATUS_CSO_OFF (1u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CTO */
#define IFX_GTM_DPLL_STATUS_CTO_OFF (3u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CRO */
#define IFX_GTM_DPLL_STATUS_CRO_OFF (4u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.RCS */
#define IFX_GTM_DPLL_STATUS_RCS_OFF (5u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.RCT */
#define IFX_GTM_DPLL_STATUS_RCT_OFF (6u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.PSE */
#define IFX_GTM_DPLL_STATUS_PSE_OFF (7u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.SOR */
#define IFX_GTM_DPLL_STATUS_SOR_OFF (8u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.MS */
#define IFX_GTM_DPLL_STATUS_MS_OFF (9u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.TOR */
#define IFX_GTM_DPLL_STATUS_TOR_OFF (10u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.MT */
#define IFX_GTM_DPLL_STATUS_MT_OFF (11u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.RAM2_ERR */
#define IFX_GTM_DPLL_STATUS_RAM2_ERR_OFF (12u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.LOW_RES */
#define IFX_GTM_DPLL_STATUS_LOW_RES_OFF (15u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CSVS */
#define IFX_GTM_DPLL_STATUS_CSVS_OFF (16u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CSVT */
#define IFX_GTM_DPLL_STATUS_CSVT_OFF (17u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CAIP2 */
#define IFX_GTM_DPLL_STATUS_CAIP2_OFF (18u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_LEN (1u)

/** \brief Mask for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_MSK (0x1u)

/** \brief Offset for Ifx_GTM_DPLL_STATUS_Bits.CAIP1 */
#define IFX_GTM_DPLL_STATUS_CAIP1_OFF (19u)

/** \brief Length for Ifx_GTM_DPLL_STATUS_Bits.ISN */
#define IFX_GTM_DPLL_STATUS_ISN_LEN (1u)

