weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT6 */
#define IFX_GTM_CCM_ARP_PROT_WPROT6_OFF (6u)

/** \brief Length for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_ARP_PROT_Bits.WPROT7 */
#define IFX_GTM_CCM_ARP_PROT_WPROT7_OFF (7u)

/** \brief Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_LEN (16u)

/** \brief Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_MSK (0xffffu)

/** \brief Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_ADDR */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_ADDR_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_LEN (2u)

/** \brief Mask for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_MSK (0x3u)

/** \brief Offset for Ifx_GTM_CCM_AEIM_STA_Bits.AEIM_XPT_STA */
#define IFX_GTM_CCM_AEIM_STA_AEIM_XPT_STA_OFF (24u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.GRSTEN */
#define IFX_GTM_CCM_HW_CONF_GRSTEN_OFF (0u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.BRIDGE_MODE_RST */
#define IFX_GTM_CCM_HW_CONF_BRIDGE_MODE_RST_OFF (1u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.SYNC_INPUT_REG */
#define IFX_GTM_CCM_HW_CONF_SYNC_INPUT_REG_OFF (2u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.CFG_CLOCK_RATE */
#define IFX_GTM_CCM_HW_CONF_CFG_CLOCK_RATE_OFF (3u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_ATOM_OUT_RST_OFF (4u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_LEN (3u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_MSK (0x7u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.ATOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_ATOM_TRIG_CHAIN_OFF (5u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_TOM_OUT_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_TOM_OUT_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.TOM_OUT_RST */
#define IFX_GTM_CCM_HW_CONF_TOM_OUT_RST_OFF (8u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_CHAIN_LEN (3u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_CHAIN_MSK (0x7u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.TOM_TRIG_CHAIN */
#define IFX_GTM_CCM_HW_CONF_TOM_TRIG_CHAIN_OFF (9u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM_HW_CONF_RAM_INIT_RST_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM_HW_CONF_RAM_INIT_RST_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.RAM_INIT_RST */
#define IFX_GTM_CCM_HW_CONF_RAM_INIT_RST_OFF (12u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM_HW_CONF_ERM_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM_HW_CONF_ERM_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.ERM */
#define IFX_GTM_CCM_HW_CONF_ERM_OFF (13u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.ARU_CONNECT_CONFIG */
#define IFX_GTM_CCM_HW_CONF_ARU_CONNECT_CONFIG_OFF (14u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_LEVEL_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_LEVEL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_LEVEL */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_LEVEL_OFF (16u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_OFF (17u)

/** \brief Length for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_LEN (1u)

/** \brief Mask for Ifx_GTM_CCM_HW_CONF_Bits.IRQ_MODE_PULSE_NOTIFY */
#define IFX_GTM_CCM_HW_CONF_IRQ_MODE_PULSE_NOTIFY_MSK (0x1u)

