weifengdq/embedded/tc364/0_Board_Test_UART0/Libraries/Infra/Sfr/TC36x/IfxGtm_bf.h
/** \brief Offset for Ifx_GTM_ATOM_CH_SOMC_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMC_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMI_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMI_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMI_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMI_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMI_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMI_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMI_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMI_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMI_ACB0_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMI_ACB0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMI_Bits.ACB0 */
#define IFX_GTM_ATOM_CH_SOMI_ACB0_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMI_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMI_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMI_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMI_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMI_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMI_FREEZE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMI_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMI_FREEZE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMI_Bits.FREEZE */
#define IFX_GTM_ATOM_CH_SOMI_FREEZE_OFF (31u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMP_MODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMP_MODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.MODE */
#define IFX_GTM_ATOM_CH_SOMP_MODE_OFF (0u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMP_ARU_EN_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMP_ARU_EN_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.ARU_EN */
#define IFX_GTM_ATOM_CH_SOMP_ARU_EN_OFF (3u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_SOMP_ADL_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_SOMP_ADL_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.ADL */
#define IFX_GTM_ATOM_CH_SOMP_ADL_OFF (4u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.BITREV */
#define IFX_GTM_ATOM_CH_SOMP_BITREV_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.BITREV */
#define IFX_GTM_ATOM_CH_SOMP_BITREV_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.BITREV */
#define IFX_GTM_ATOM_CH_SOMP_BITREV_OFF (6u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.SR0_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_SR0_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.SR0_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_SR0_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.SR0_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_SR0_TRIG_OFF (7u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMP_SL_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMP_SL_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.SL */
#define IFX_GTM_ATOM_CH_SOMP_SL_OFF (11u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMP_CLK_SRC_SR_LEN (3u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMP_CLK_SRC_SR_MSK (0x7u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.CLK_SRC_SR */
#define IFX_GTM_ATOM_CH_SOMP_CLK_SRC_SR_OFF (12u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMP_ECLK_SRC_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMP_ECLK_SRC_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.ECLK_SRC */
#define IFX_GTM_ATOM_CH_SOMP_ECLK_SRC_OFF (15u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_SOMP_TRIG_PULSE_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_SOMP_TRIG_PULSE_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.TRIG_PULSE */
#define IFX_GTM_ATOM_CH_SOMP_TRIG_PULSE_OFF (17u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_SOMP_UDMODE_LEN (2u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_SOMP_UDMODE_MSK (0x3u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.UDMODE */
#define IFX_GTM_ATOM_CH_SOMP_UDMODE_OFF (18u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_SOMP_RST_CCU0_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_SOMP_RST_CCU0_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.RST_CCU0 */
#define IFX_GTM_ATOM_CH_SOMP_RST_CCU0_OFF (20u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_OSM_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_OSM_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.OSM_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_OSM_TRIG_OFF (21u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_EXT_TRIG_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_EXT_TRIG_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.EXT_TRIG */
#define IFX_GTM_ATOM_CH_SOMP_EXT_TRIG_OFF (22u)

/** \brief Length for Ifx_GTM_ATOM_CH_SOMP_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_EXTTRIGOUT_LEN (1u)

/** \brief Mask for Ifx_GTM_ATOM_CH_SOMP_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_EXTTRIGOUT_MSK (0x1u)

/** \brief Offset for Ifx_GTM_ATOM_CH_SOMP_Bits.EXTTRIGOUT */
#define IFX_GTM_ATOM_CH_SOMP_EXTTRIGOUT_OFF (23u)

